app/Controllers/Produk.php

                'stok' => $this->request->getPost('stok'),
            ];
            //   var_dump($data);
            $this->produk->Insert($data);
---
INSERT INTO `produk` (`kode_produk`, `nama_produk`, `id_kategori`, `id_satuan`, `harga_jual`, `harga_beli`, `stok`) VALUES ('7878', 'bread', '1', '1', '12000', '11000', '5')