app/Models/ModelAdmin.php

    public function Grafik()
    {
        return $this->db->table('detailpenjualan')
            ->join('penjualan', 'penjualan.no_faktur=detailpenjualan.no_faktur')
            ->where('month(penjualan.tgl_penjualan)', date('m'))
            ->where('year(penjualan.tgl_penjualan)', date('Y'))
            ->select('penjualan.tgl_penjualan')
            ->groupBy('penjualan.tgl_penjualan')
            ->selectSum('detailpenjualan.subtotal')
            ->selectSum('detailpenjualan.untung')
            ->get()
            ->getResultArray();
---
SELECT `penjualan`.`tgl_penjualan`, SUM(`detailpenjualan`.`subtotal`) AS `subtotal`, SUM(`detailpenjualan`.`untung`) AS `untung`
FROM `detailpenjualan`
JOIN `penjualan` ON `penjualan`.`no_faktur`=`detailpenjualan`.`no_faktur`
WHERE month(penjualan.tgl_penjualan) = '02'
AND year(penjualan.tgl_penjualan) = '2024'
GROUP BY `penjualan`.`tgl_penjualan`

    public function Todayincome()
    {
        return $this->db->table('detailpenjualan')
            ->join('penjualan', 'penjualan.no_faktur=detailpenjualan.no_faktur')
            ->where('penjualan.tgl_penjualan', date('Y-m-d'))
            ->groupBy('penjualan.tgl_penjualan')
            ->selectSum('detailpenjualan.subtotal')
            ->get()->getRowArray();
---
SELECT SUM(`detailpenjualan`.`subtotal`) AS `subtotal`
FROM `detailpenjualan`
JOIN `penjualan` ON `penjualan`.`no_faktur`=`detailpenjualan`.`no_faktur`
WHERE `penjualan`.`tgl_penjualan` = '2024-02-27'
GROUP BY `penjualan`.`tgl_penjualan`

    public function Monthincome()
    {
        return $this->db->table('detailpenjualan')
            ->join('penjualan', 'penjualan.no_faktur=detailpenjualan.no_faktur')
            ->where('month(penjualan.tgl_penjualan)', date('m'))
            ->where('year(penjualan.tgl_penjualan)', date('Y'))
            ->groupBy('penjualan.tgl_penjualan')
            ->selectSum('detailpenjualan.subtotal')
            ->get()->getRowArray();
---
SELECT SUM(`detailpenjualan`.`subtotal`) AS `subtotal`
FROM `detailpenjualan`
JOIN `penjualan` ON `penjualan`.`no_faktur`=`detailpenjualan`.`no_faktur`
WHERE month(penjualan.tgl_penjualan) = '02'
AND year(penjualan.tgl_penjualan) = '2024'
GROUP BY `penjualan`.`tgl_penjualan`

    public function Yearincome()
    {
        return $this->db->table('detailpenjualan')
            ->join('penjualan', 'penjualan.no_faktur=detailpenjualan.no_faktur')
            ->where('year(penjualan.tgl_penjualan)', date('Y'))
            // ->select('jual.tgl_jual')
            ->groupBy('year(penjualan.tgl_penjualan)')
            ->selectSum('detailpenjualan.subtotal')
            ->get()
            ->getRowArray();
---
SELECT SUM(`detailpenjualan`.`subtotal`) AS `subtotal`
FROM `detailpenjualan`
JOIN `penjualan` ON `penjualan`.`no_faktur`=`detailpenjualan`.`no_faktur`
WHERE year(penjualan.tgl_penjualan) = '2024'
GROUP BY year(penjualan.tgl_penjualan)

    public function jlhproduk()
    {
        return $this->db->table('produk')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `produk`

    public function jlhkategori()
    {
        return $this->db->table('kategori')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `kategori`

    public function jlhsatuan()
    {
        return $this->db->table('satuan')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `satuan`

    public function jlhuser()
    {
        return $this->db->table('user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `user`