app/Models/ModelProduk.php

SELECT `produk`.`kode_produk`, `produk`.`nama_produk`, `kategori`.`id_kategori`, `satuan`.`id_satuan`, `kategori`.`nama_kategori`, `produk`.`harga_jual`, `produk`.`harga_beli`, `produk`.`stok`, `produk`.`id_produk`, `satuan`.`nama_satuan`
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori`=`produk`.`id_kategori`
JOIN `satuan` ON `satuan`.`id_satuan`=`produk`.`id_satuan`
ORDER BY `id_produk` DESC
---
   public function AllData()
   {
      $produk = new ModelProduk;
      $produk->select('produk.kode_produk, produk.nama_produk,kategori.id_kategori, satuan.id_satuan, kategori.nama_kategori,  produk.harga_jual, produk.harga_beli, produk.stok, produk.id_produk,
                  satuan.nama_satuan');
      $produk->join('kategori', 'kategori.id_kategori=produk.id_kategori');
      $produk->join('satuan', 'satuan.id_satuan=produk.id_satuan');
      $produk->orderBy('id_produk', 'DESC');
      return $produk->findAll();