app/Models/ModelKategori.php

SELECT *
FROM `kategori`
---
   public function AllData()
   {

      return $this->db->table('kategori')
         ->get()
         ->getResultArray();