app/Models/ModelPenjualan.php

SELECT *
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori`=`produk`.`id_kategori`
JOIN `satuan` ON `satuan`.`id_satuan`=`produk`.`id_satuan`
WHERE `kode_produk` = '5555'
---
   public function CekProduk($kode_produk)
   {
      return $this->db->table('produk')
         ->join('kategori', 'kategori.id_kategori=produk.id_kategori')
         ->join('satuan', 'satuan.id_satuan=produk.id_satuan')
         ->where('kode_produk', $kode_produk)
         ->get()
         ->getRowArray();

SELECT `produk`.`kode_produk`, `produk`.`nama_produk`, `kategori`.`id_kategori`, `satuan`.`id_satuan`, `kategori`.`nama_kategori`, `produk`.`harga_jual`, `produk`.`stok`, `produk`.`id_produk`, `satuan`.`nama_satuan`
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori`=`produk`.`id_kategori`
JOIN `satuan` ON `satuan`.`id_satuan`=`produk`.`id_satuan`
WHERE `stok` >0
---
   public function AllProduk()
   {
      $produk = new ModelProduk;
      $produk->select('produk.kode_produk, produk.nama_produk,kategori.id_kategori, satuan.id_satuan, kategori.nama_kategori,  produk.harga_jual, produk.stok, produk.id_produk,
                  satuan.nama_satuan');
      $produk->join('kategori', 'kategori.id_kategori=produk.id_kategori');
      $produk->join('satuan', 'satuan.id_satuan=produk.id_satuan');
      $produk->where('stok > 0');

      return $produk->findAll();

INSERT INTO `penjualan` (`no_faktur`, `tgl_penjualan`, `time`, `grand_total`, `dibayar`, `kembalian`, `id_user`) VALUES ('202402270005', '2024-02-27', '13:04:11', 42000, '50000', '8000', '4')
---
   public function InsertJual($data)
   {
      $this->db->table('penjualan')->insert($data);

INSERT INTO `detailpenjualan` (`no_faktur`, `kode_produk`, `harga`, `modal`, `qty`, `subtotal`, `untung`) VALUES ('202402270005', '5555', 42000, '42000', 1, 42000, 0)
---
   public function InsertDetailJual($data)
   {
      $this->db->table('detailpenjualan')->insert($data);